{
  "id": 1,
  "date": "April 23, 2024",
  "category": 1,
  "image": "borovets-brothers.jpeg",
  "title": "Building our Website",
  "author": "Petro Borovets",
  "hoursOnCalls": "5",
  "headSection": {
    "headingText": "Отже, тут мала би бути коротка історія про те, як будується наш сайт… або як він колись таки побудувався. Ідея зародилась у родині справжніх айті-альхіміків: молодший брат - чарівник фронтенду, а старший - майстер бекенду. І що ж тут могло піти не так? План був простий, як два байти переслати: молодший практикується у бекенді, а старший брат розважається з фронтендом. Так вони обмінювались досвідом - хто брав функції, хто стилі, а що вийде з цього магічного експерименту, я напишу трохи пізніше… якщо сайт не зникне в міжвимірну айті-прірву покинутих проектів.",
    "headingSubText": "Мрія завести сайтик, де можна документувати щось корисне, переживала злети і падіння, як запуск серверу на п’ятничний вечір. Хотілося створити місце, де з часом можна буде із легкою ностальгією гортати старі пости і згадувати, як світ був молодший, а код - багатший на баги.. Наш сайтик написаний на React, піднятий із гордістю на GitHub Pages, а стилізація - це чисте мистецтво, без допомоги CSS фреймворків (бо хто ж не любить трохи викликів, правда?). Весь контент зберігається у JSON файлах, так само, як і фотографії, які розкидані по сорсах. Це робить сайт зручним для швидких змін - якщо захочеш, можна все підрихтувати за кілька кліків. Ось для прикладу лінк на json файл який містить контент для цього параграфу: <a href=\"https://github.com/petroborovets/rovets/blob/5c52f4dba2a5673716a8078e667ddd05f43abad6/src/constants/posts.json#L13\" target=\"_blank\">GitHub<a/>."
  },
  "sections": [
    {
      "id": 1,
      "heading": "Цікаві факти",
      "children": [
        {
          "id": 1,
          "type": "list",
          "value": [
            "Скільки днів я працював над сайтом? 12 днів - це, мабуть, як 12 подвигів Геракла, тільки з трохи менше фізичної активності, але значно більше кофеїну. Ну і так, звичайно реальний час зрачно більший, так як я це не апдейтував вже хто зна скільки часу.",
            "Кількість годин на мітингах із братом: 9 годин. І от тут найцікавіше - мітинги з молодшим братом проходили у напруженій атмосфері, бо він був трохи злий, що я постійно тягнув його від ігор. Щоразу перед нарадою він дивився на мене як на фінального боса, якого ну ніяк не може уникнути. І хоча я його мучив фронтендом, переконаний, що це тренувало його витривалість не гірше, ніж будь-який квест. Слава Богу, за ті 9 годин старший брат зміг нарешті піднятися з колін, на яких він стояв, зітхаючи над фронтендом. Повільними, але впевненими кроками, він повернувся до життя, хоча кожен рядок CSS ще довго буде злегка болісно відгукуватись у його пам’яті."
          ]
        }
      ]
    },
    {
      "id": 2,
      "heading": "Проблеми із якими зіштовхнулись",
      "children": [
        {
          "id": 1,
          "type": "list",
          "value": [
            "Спарування React Browser Router із Github Pages, про проблему можна почитати тут: <a href=\"https://stackoverflow.com/questions/46056414/getting-404-for-links-with-create-react-app-deployed-to-github-pages\" target=\"_blank\">StackOverflow<a/>. Рішення було використовувати Reacts Hash Router, рішення не найкраще, так як воно псує естетику URLs, але воно швидке і працює: <a href=\"https://reactrouter.com/en/main/routers/create-hash-router\" target=\"_blank\">www.reactrouter.com<a/>."
          ]
        }
      ]
    }
  ]
}