{
  "posts": [
    {
      "id": 1,
      "date": "April 23, 2024",
      "category": 1,
      "image": "borovets-brothers.jpeg",
      "title": "Building our Website",
      "author": "Petro Borovets",
      "hoursOnCalls": "5",
      "headSection": {
        "headingText": "Отже, тут мала би бути коротка історія про те, як будується наш сайт… або як він колись таки побудувався. Ідея зародилась у родині справжніх айті-альхіміків: молодший брат - чарівник фронтенду, а старший - майстер бекенду. І що ж тут могло піти не так? План був простий, як два байти переслати: молодший практикується у бекенді, а старший брат розважається з фронтендом. Так вони обмінювались досвідом - хто брав функції, хто стилі, а що вийде з цього магічного експерименту, я напишу трохи пізніше… якщо сайт не зникне в міжвимірну айті-прірву покинутих проектів.",
        "headingSubText": "Мрія завести сайтик, де можна документувати щось корисне, переживала злети і падіння, як запуск серверу на п’ятничний вечір. Хотілося створити місце, де з часом можна буде із легкою ностальгією гортати старі пости і згадувати, як світ був молодший, а код - багатший на баги.. Наш сайтик написаний на React, піднятий із гордістю на GitHub Pages, а стилізація - це чисте мистецтво, без допомоги CSS фреймворків (бо хто ж не любить трохи викликів, правда?). Весь контент зберігається у JSON файлах, так само, як і фотографії, які розкидані по сорсах. Це робить сайт зручним для швидких змін - якщо захочеш, можна все підрихтувати за кілька кліків. Ось для прикладу лінк на json файл який містить контент для цього параграфу: <a href=\"https://github.com/petroborovets/rovets/blob/5c52f4dba2a5673716a8078e667ddd05f43abad6/src/constants/posts.json#L13\" target=\"_blank\">GitHub<a/>."
      },
      "sections": [
        {
          "id": 1,
          "heading": "Цікаві факти",
          "children": [
            {
              "id": 1,
              "type": "list",
              "value": [
                "Скільки днів я працював над сайтом? 12 днів - це, мабуть, як 12 подвигів Геракла, тільки з трохи менше фізичної активності, але значно більше кофеїну. Ну і так, звичайно реальний час зрачно більший, так як я це не апдейтував вже хто зна скільки часу.",
                "Кількість годин на мітингах із братом: 9 годин. І от тут найцікавіше - мітинги з молодшим братом проходили у напруженій атмосфері, бо він був трохи злий, що я постійно тягнув його від ігор. Щоразу перед нарадою він дивився на мене як на фінального боса, якого ну ніяк не може уникнути. І хоча я його мучив фронтендом, переконаний, що це тренувало його витривалість не гірше, ніж будь-який квест. Слава Богу, за ті 9 годин старший брат зміг нарешті піднятися з колін, на яких він стояв, зітхаючи над фронтендом. Повільними, але впевненими кроками, він повернувся до життя, хоча кожен рядок CSS ще довго буде злегка болісно відгукуватись у його пам’яті."
              ]
            }
          ]
        },
        {
          "id": 2,
          "heading": "Проблеми із якими зіштовхнулись",
          "children": [
            {
              "id": 1,
              "type": "list",
              "value": [
                "Спарування React Browser Router із Github Pages, про проблему можна почитати тут: <a href=\"https://stackoverflow.com/questions/46056414/getting-404-for-links-with-create-react-app-deployed-to-github-pages\" target=\"_blank\">StackOverflow<a/>. Рішення було використовувати Reacts Hash Router, рішення не найкраще, так як воно псує естетику URLs, але воно швидке і працює: <a href=\"https://reactrouter.com/en/main/routers/create-hash-router\" target=\"_blank\">www.reactrouter.com<a/>."
              ]
            }
          ]
        }
      ]
    },
    {
      "id": 2,
      "date": "June 15, 2024",
      "category": 4,
      "image": "brela/borovets-family-brela-mirror.jpeg",
      "title": "Places we have been",
      "author": "Petro Borovets",
      "headSection": {
        "headingText": "Пам’ять про той день живе в мені, хоча це було так давно. Спека стояла нестерпна, і повітря, гаряче й важке, здавалося густішим, ніж зазвичай. Кожен крок був наче занурення у щільний потік розжареного повітря, яке ніжно обвивало мою шкіру. Ми йшли довго, і втома вплелася в наші тіла, але раптом, коли я підняв камеру, сталося дещо чарівне. Вітер, наче несподіваний подарунок, ніжно подув у спину, приніс із собою прохолодний подих моря, і в ту мить я відчув, як свіжі краплинки прохолодної води оживили мою шкіру. Втома зникла, як розтанувший дим.",
        "headingSubText": "Ми продовжували наш шлях вузькою стежкою Брели - вона там одна-єдина, довга, наче стрічка, що звивається вздовж мальовничих краєвидів. Стежка бере свій початок у місті Baška Voda і веде крізь усе місто Brela аж до Jakiruša. Ми йшли вперед, зачаровані пейзажами та думками про те, що чекає на нас у самому кінці цієї неймовірної подорожі."
      },
      "sections": [
        {
          "id": 1,
          "heading": "Пішохідна доріжка Брели",
          "children": [
            {
              "id": 1,
              "type": "images",
              "value": [
                {
                  "original": "https://petroborovets.github.io/rovets/brela/brela-stone.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/brela/brela-stone.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/brela/route.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/brela/route.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/brela/brela-boat.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/brela/brela-boat.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/brela/brela-shore.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/brela/brela-shore.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/brela/brela-tree.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/brela/brela-tree.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/brela/brela-tree-with-s.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/brela/brela-tree-with-s.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/brela/borovets-family-brela-mirror.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/brela/borovets-family-brela-mirror.jpeg"
                }
              ]
            }
          ]
        },
        {
          "id": 2,
          "heading": "Вихідний біля річки Опір",
          "children": [
            {
              "id": 1,
              "type": "paragraph",
              "value": "Коротке відео про Софію, майстра збирання каміння з річкових берегів. Чи це нове хобі? Чи, можливо, секретний план по створенню приватної колекції найкращих каменів світу? Я ще не дійшов до суті цієї загадки, але певен: за кожним каменем ховається великий філософський сенс. Можливо, кожен камінчик – це частинка всесвіту, яку вона рятує від забуття. Або ж просто у нашій мікроскопічній квартирі буде найкрасивіший кам’яний сад. Що точно знаю – це те, що зупинити її вже не можна!"
            },
            {
              "id": 2,
              "type": "paragraph",
              "value": "Трофеї поїздки:"
            },
            {
              "id": 3,
              "type": "list",
              "value": ["Камінь 1", "Камінь 2", "Спогади з річки Опір"]
            },
            {
              "id": 4,
              "type": "youtubeVideo",
              "value": "https://www.youtube.com/embed/GeYrDlFPqYI?si=wbNhP3okocM3aUTj"
            }
          ]
        }
      ]
    },
    {
      "id": 3,
      "date": "Jul 15, 2024",
      "category": 2,
      "image": "/cycling/two-wheels/hodovytsya.jpeg",
      "title": "A Taste of Freedom",
      "author": "Petro Borovets",
      "headSection": {
        "headingText": "Cycling is more than just a means of transportation, it's an invitation to explore, a journey on two wheels that merges the physical with the spiritual. As you ride, the world around you transforms - each pedal stroke propels you into a new moment, a fresh perspective. ",
        "headingSubText": "The wind in your hair becomes a whisper of freedom, a reminder that you're part of something larger, something alive."
      },
      "sections": [
        {
          "id": 1,
          "heading": "",
          "children": [
            {
              "id": 1,
              "type": "image",
              "value": "/cycling/two-wheels/1.jpeg"
            },
            {
              "id": 2,
              "type": "paragraph",
              "value": "The road ahead unrolls like a story waiting to be told, every turn revealing a new chapter, every mile deepening your connection with the journey. The rhythmic motion of pedaling is like a heartbeat, steady and reliable, grounding you in the present while pushing you forward into the unknown."
            },
            {
              "id": 3,
              "type": "image",
              "value": "/cycling/two-wheels/5.jpeg"
            },
            {
              "id": 4,
              "type": "paragraph",
              "value": "In this journey, there's a unique blend of exhilaration and calm. The thrill of speed and the rush of the ride are balanced by the meditative focus that comes with the repetitive motion, the sound of tires meeting pavement, the subtle shifts in terrain. It's a dance between effort and ease, a harmony between body and mind."
            },
            {
              "id": 5,
              "type": "image",
              "value": "/cycling/two-wheels/2.jpeg"
            },
            {
              "id": 6,
              "type": "paragraph",
              "value": "Cycling connects you to the world in a way few other activities can. You're not just passing through the landscape; you're immersed in it, feeling every hill, every gust of wind, every ray of sunlight. It's a sensory experience that sharpens your awareness and heightens your appreciation for the simple, often overlooked details of life."
            },
            {
              "id": 7,
              "type": "image",
              "value": "/cycling/two-wheels/6.jpeg"
            },
            {
              "id": 8,
              "type": "paragraph",
              "value": "At the same time, cycling is a personal journey. It's a chance to test your limits, to push beyond what you thought possible, and to discover new strengths. But it's also a space for introspection, where the steady rhythm of the ride creates a quiet mental space for reflection and clarity."
            },
            {
              "id": 9,
              "type": "image",
              "value": "/cycling/two-wheels/4.jpeg"
            },
            {
              "id": 10,
              "type": "paragraph",
              "value": "Whether you're riding through a bustling city or along a tranquil country road, cycling offers a unique blend of adventure and serenity. It's a reminder that the journey itself is as important as the destination, that in the simple act of moving forward on two wheels, you can find both excitement and peace, challenge and comfort, freedom and connection."
            }
          ]
        }
      ]
    },
    {
      "id": 4,
      "date": "April 25, 2024",
      "category": 8,
      "image": "gaming/cyberpunk/cyberpunk_logo.jpeg",
      "title": "Cyberpunk 2077",
      "author": "Andrii Borovets",
      "headSection": {
        "headingText": "I had a mixed feelings about this game, I started playing it few month after it came out and I didn't like the gameplay and after 10 or so hours of game I quit it. But now in 2024 the game had a lot of improvements and updates and I decided to give it another try.",
        "headingSubText": "I am a big fan of RPG games, but usually I play games that are placed in the medieval times (meaning there are no technologies and just a big sword :) ), My favorite game so far is the Elden ring in which I have spend more then 600 hours playing. Also played a lot of WOW (World of warcraft) but after spending so many horus playing these games I wanted something new, and this is where the Cyberpunk 2077 kicks in."
      },
      "sections": [
        {
          "id": 1,
          "heading": "List of topics",
          "children": [
            {
              "id": 1,
              "type": "list",
              "value": [
                "Overview",
                "Gameplay experience",
                "My build in the game",
                "Conclusion"
              ]
            }
          ]
        },
        {
          "id": 2,
          "heading": "Overview",
          "children": [
            {
              "id": 1,
              "type": "paragraph",
              "value": "<b>Genre:</b> Action RPG"
            },
            {
              "id": 2,
              "type": "paragraph",
              "value": "<b>Mode:</b> Single-player"
            },
            {
              "id": 3,
              "type": "paragraph",
              "value": "<b>Setting:</b> </br> \"Cyberpunk 2077\" is set in the dystopian future of Night City, a sprawling metropolis located in the Free State of Northern California. The game takes place in the year 2077, where mega-corporations dominate every facet of life, and technology is deeply integrated into human existence. The city is divided into six distinct districts, each with its own culture, architecture, and level of danger."
            },
            {
              "id": 4,
              "type": "image",
              "value": "gaming/cyberpunk/night_city.jpeg"
            },
            {
              "id": 5,
              "type": "paragraph",
              "value": "The world of Cyberpunk 2077 is heavily inspired by the cyberpunk genre, featuring a blend of high-tech and low-life elements. The city is filled with advanced technology, cybernetic enhancements, and a diverse array of characters ranging from street thugs to corporate executives."
            }
          ]
        },
        {
          "id": 3,
          "heading": "Gameplay experience",
          "children": [
            {
              "id": 1,
              "type": "paragraph",
              "value": "At the first time playing this game I didn't like the experience I had. But playing it for the second time it all changed. I guess the reason is that the game was constantly improving. I still have a lot of problems with the way they implemented the driving in the game, it doesn't feel realistic at all, the physics of it I mean. Also the way you experience speed - you can drive 200 mph and it feels like you drive 100kph, But that is not the selling point of this game I guess and I can understand why they didn't spend more time improving the driving experience."
            },
            {
              "id": 1,
              "type": "paragraph",
              "value": "The combat experience however is much better, I guess it is partially of the build I decided to play, but more on that later. The combat experience is what made me hooked to the game. There are different ways to go with it. Meaning you can build your character in many different ways. What I see is 3 ways to play it. </br> 1) Playing as a mage (using quick hacks). Which relays on injecting hacks into technologies, or people that use cyber ware (which is all people in cyberpunk). </br> 2) Weapon(ranger) Which utilizes all types of weapons as you guessed. </br> 3) Melee weapons. Yep using sword :) (My favourite) "
            }
          ]
        },
        {
          "id": 4,
          "heading": "My build in the game",
          "children": [
            {
              "id": 1,
              "type": "image",
              "value": "gaming/cyberpunk/character.jpg"
            },
            {
              "id": 2,
              "type": "paragraph",
              "value": "I decided to play with a katana weapon with a mix of using a stenciled pistol and a sniper rifle. I found that this build is really fun to play considering the fact that you can use katana to deflect bullets. </br> Most of the combat I am trying to stay in the shadows and finish off all my enemies with the silenced pistol which makes 150% more damage when you hit the head. Once I am detected I am switching to katana, and the sniper rifle is just there as the cool attribute that is affecting stealth and pistols - also shares the perks to sniper rifles. But I rarely use it."
            },
            {
              "id": 3,
              "type": "paragraph",
              "value": "<b>Attributes</b>"
            },
            {
              "id": 4,
              "type": "image",
              "value": "gaming/cyberpunk/attributes.jpg"
            },
            {
              "id": 5,
              "type": "paragraph",
              "value": "Here you can see what Attributes I am using. </br> Reflexes - affect the movement and the katana. </br> Cool - affects the pistols, stealth and sniper rifles. </br> Other don't really affect my build."
            },
            {
              "id": 6,
              "type": "image",
              "value": "gaming/cyberpunk/reflexes.jpg"
            },
            {
              "id": 7,
              "type": "paragraph",
              "value": "The reflexes is one of the most interesting attributes that you can chose. It affects the movement and allows you to almost fly from one enemy to another in an instant. Allows you to make a dash which is sort of a teleport that blinks you ~10 meters. "
            }
          ]
        },
        {
          "id": 5,
          "heading": "Conclusion",
          "children": [
            {
              "id": 7,
              "type": "paragraph",
              "value": "So far I have spent around 60 hours playing this game. And I think it has a lot of progress since it lunched. The story is interesting and grips you and the combat is perfect if you chose the right build. And as for the problems, I would say they are outweighed by all the adventures. The game of course has some bugs and problems but nothing serious that ruins the gameplay. So I really recommend you to try it out!)"
            }
          ]
        }
      ]
    },
    {
      "id": 5,
      "date": "Aug 10, 2024",
      "category": 1,
      "image": "dev/react.webp",
      "title": "Notes on React",
      "author": "Petro Borovets",
      "headSection": {
        "headingText": "React, sometimes referred to as a frontend JavaScript framework, but actually is a free, open-source FE library created by Facebook. It is maintained by Meta and a community of individual developers and companies. Library can be utilized to build single-page applications, mobile apps, or server-rendered apps with frameworks such as Next.js. Since React focuses solely on the user interface and rendering components to the DOM, applications built with React often depend on additional libraries for routing and other client-side functionalities.",
        "headingSubText": "A major benefit of React is its ability to only rerender the parts of the page that have changed, thus avoiding the unnecessary re-rendering of elements that remain unchanged. React was initially released on May 29, 2013."
      },
      "sections": [
        {
          "id": 1,
          "heading": "Content",
          "children": [
            {
              "id": 1,
              "type": "list",
              "value": [
                "Overview",
                "Components, props, JSX",
                "State, events and Forms: Interactive Components",
                "State management",
                "How React works behind the scenes",
                "Effects and Data Fetching",
                "Hooks, Refs and More State",
                "Advanced State Management: The Context API"
              ]
            }
          ]
        },
        {
          "id": 2,
          "heading": "Overview",
          "children": [
            {
              "id": 1,
              "type": "paragraph",
              "value": "React allows developers to create reusable UI components, manage the state of these components efficiently, and build complex interfaces with a declarative approach."
            },
            {
              "id": 2,
              "type": "paragraph",
              "value": "Here are some key features of React:"
            },
            {
              "id": 3,
              "type": "list",
              "value": [
                "<b>Component-Based Architecture</b>: React encourages the development of applications using small, reusable components. Each component encapsulates its own logic and rendering, making the code more modular and easier to maintain.",
                "<b>Virtual DOM</b>: React uses a virtual DOM to optimize rendering performance. When a component's state changes, React updates the virtual DOM first and then efficiently reconciles and updates only the parts of the real DOM that have changed.",
                "<b>Declarative Syntax</b>: React allows developers to describe what the UI should look like for a given state using a declarative syntax, making it easier to understand and manage the code.",
                "<b>JSX (JavaScript XML)</b>: React uses JSX, a syntax extension that allows you to write HTML-like code within JavaScript. JSX makes the code more readable and easier to write by combining the power of JavaScript with the simplicity of HTML.",
                "<b>State Management</b>: React provides a mechanism to manage component state, allowing components to respond to user inputs and other events dynamically. State management is essential for creating interactive UIs.",
                "<b>One-Way Data Binding</b>: React uses one-way data binding, meaning that data flows in a single direction - from parent to child components. This makes it easier to track changes and debug applications.",
                "<b>React Hooks</b>: Introduced in React 16.8, hooks are functions that let you use state and other React features without writing class components. Hooks like <code>useState</code>, <code>useEffect</code>, and <code>useContext</code> simplify state management and side effects.",
                "<b>React Router</b>: React Router is a library for handling routing in React applications, enabling navigation between different views or pages without reloading the entire application."
              ]
            }
          ]
        },
        {
          "id": 3,
          "heading": "Components, props, JSX",
          "children": [
            {
              "id": 1,
              "type": "paragraph",
              "value": "<b>Components</b> are the building blocks of a React application. They encapsulate parts of the user interface and manage their own state and behavior. There are two types of components: <b>Functional Components</b> and <b>Class Components</b>."
            },
            {
              "id": 2,
              "type": "list",
              "value": [
                "<b>Functional components</b> are Functions that return React elements. They can use hooks to manage state and side effects.",
                "<b>Class components</b> are ES6 classes that extend <b>React.Component</b>. They have lifecycle methods and can manage state using <code>this.state</code>."
              ]
            },
            {
              "id": 3,
              "type": "image",
              "value": "dev/react-post/1-read-only-props.png"
            },
            {
              "id": 4,
              "type": "paragraph",
              "value": "<b>Props</b> (short for properties) are a way to pass data from a parent component to a child component. Props are read-only and help to make components reusable by allowing them to receive data and configuration from their parent. So in React we have only one way data flow. <br><b>Accessing Props:</b> In functional components, props are accessed directly as function arguments. In class components, they are accessed via <code>this.props</code>. "
            },
            {
              "id": 5,
              "type": "image",
              "value": "dev/react-post/2-one-way data-flow.png"
            },
            {
              "id": 6,
              "type": "paragraph",
              "value": "<b>JSX (JavaScript XML)</b> is a syntax extension for JavaScript that allows you to write HTML-like code within JavaScript. It makes it easier to create React elements and components. JSX is compiled to <code>React.createElement</code> calls, which produce JavaScript objects that describe the UI."
            },
            {
              "id": 7,
              "type": "image",
              "value": "dev/react-post/3-jsx-rules.png"
            },
            {
              "id": 8,
              "type": "paragraph",
              "value": "<b>So, lets sum-up:</b>"
            },
            {
              "id": 9,
              "type": "list",
              "value": [
                "<b>Components:</b> Reusable pieces of UI that can be either functional or class-based.",
                "<b>Props:</b> Mechanism for passing data to components, making them dynamic and reusable.",
                "<b>JSX:</b> Syntax extension that allows you to write HTML-like code in JavaScript, making the creation of React elements more intuitive."
              ]
            }
          ]
        },
        {
          "id": 4,
          "heading": "State, events and Forms: Interactive Components",
          "children": [
            {
              "id": 1,
              "type": "paragraph",
              "value": "In React, <b>state</b> is a core concept used to manage data that changes over time and affects how a component renders. State is an object that represents the parts of the <b>component</b> that can change and is managed within the component itself."
            },
            {
              "id": 2,
              "type": "image",
              "value": "dev/react-post/7-react-naming.png"
            },
            {
              "id": 3,
              "type": "paragraph",
              "value": "Both <b>state</b> and <b>props</b> are used to manage data within components, but they serve different purposes and have distinct characteristics."
            },
            {
              "id": 4,
              "type": "image",
              "value": "dev/react-post/8-state-vs-props.png"
            }
          ]
        },
        {
          "id": 5,
          "heading": "State management",
          "children": [
            {
              "id": 1,
              "type": "paragraph",
              "value": "Knowing <b>when</b> and <b>where</b> to use <b>state</b> is crucial for building efficient and maintainable React applications. Here’s a guide on how to use state effectively:"
            },
            {
              "id": 2,
              "type": "image",
              "value": "dev/react-post/11-state-where-when.png"
            },
            {
              "id": 3,
              "type": "paragraph",
              "value": "Lets take a look at the example below.<br>Please check UI mockup on the right side of the diagram, we have 3 components:<br>- Parent: <b>Checkout</b>, <br>- Two children: <b>Total</b> and <b>Promotions</b>.<br>Since <b>Promotions</b> component uses <b>coupons</b>, the logical step would be to place <b>coupons</b> state on the component level. But we quickly realize that <b>Total</b> component should be aware of coupons as well. How can we solve this issue?"
            },
            {
              "id": 4,
              "type": "image",
              "value": "dev/react-post/12-state-sharing-with-sibling-component-problem.png"
            },
            {
              "id": 5,
              "type": "paragraph",
              "value": "Solution to this problem would be to \"Lift up\" the State to parent <b>Checkout</b> component and share this state with children using props. Here is how it work:"
            },
            {
              "id": 6,
              "type": "image",
              "value": "dev/react-post/13-lifting-up-the-state.png"
            }
          ]
        },
        {
          "id": 6,
          "heading": "How React works behind the scenes",
          "children": [
          ]
        },
        {
          "id": 11,
          "heading": "Notes / question-answers",
          "children": [
            {
              "id": 1,
              "type": "list",
              "value": [
                "Reacts <code>useState</code> <b>hook</b> returns an array with 2 properties:<br>First - current state of the property,<br>Second - function that you use to update the state of the property.<br>Ex: <code>const [value, setValue] = useState(someValue)</code> where <code>someValue</code> is an initial state of the value.",
                "All react functions that start with <code>use</code> keyword are react hooks.",
                "You can only call <b>hooks</b> on the top level of component function.",
                "What is <b>Derived State</b>? - <b>Derived State</b>: state that is computed from an existing peace of state or from props.",
                "<b>Component</b> vs <b>Instance</b> vs <b>Element</b>:<br>- <b>Component</b> is a code blueprint,<br>- <b>Instance</b> is a \"physical\" representation of the component. <br>- <b>Element</b>: Now, as we know components return JSX which is converted to <code>React.createElement</code> function calls, so <b>Element</b> is a result of usage of <b>Component</b> in our code -it is simply a big immutable javascript object that React keeps in memory. React <b>Element</b> contains all necessary information in order to create DOM elements for the current component instance."
              ]
            }
          ]
        }
      ]
    },
    {
      "id": 6,
      "date": "Aug 15, 2024",
      "category": 2,
      "image": "/cycling/centuries/yasinia-4.jpeg",
      "title": "Centuries",
      "author": "Petro Borovets",
      "headSection": {
        "headingText": "The century ride. That grand, mythical beast of the cycling world, where pedal meets pavement for a grueling 100 kilometers (or 100 miles if you’re from a land where kilometers fear to tread). Whether it’s on winding roads in metric countries or sprawling miles in imperial lands, it’s a right of passage, an ode to endurance. Organized by cycling clubs, these events draw us in with the promise of camaraderie, self-doubt, and probably the finest post-ride snacks you’ll ever encounter. Some clubs even make it an annual affair - a social gathering, a fundraiser, a chance to test one’s mettle against the clock, the road, and their own excuses.",
        "headingSubText": "The origins of the century ride are as murky as a foggy mountain pass, though whispers suggest it first surfaced in the United States, circa 1890. That was when cycling was the latest craze - before smartphones, selfies, and riding for “the ‘Gram.” Back then, the goal wasn’t just to cover a distance, but to prove something: you had the endurance, the fitness, and maybe just enough madness to ride for hours on end. Fast forward to today, and the century ride remains a milestone for cyclists around the world. It’s more than just a badge of honor - it’s a love letter to the open road, a connection to the rich, sometimes bizarre history of the sport. And trust me, it’s one heck of a story to tell at the next gathering over coffee… or, you know, sports drinks."
      },
      "sections": [
        {
          "id": 2,
          "heading": "October 21, 2024 – From Lviv to Zhovkva: A Ride Through Serenity, Cake, and Canine Wisdom",
          "children": [
            {
              "id": 1,
              "type": "paragraph",
              "value": "Yesterday, I decided to embark on a solo cycling adventure from Lviv to the picturesque town of Zhovkva and back. Let me just say, it was a ride straight out of a fairy tale. The weather? Perfect. No wind, hardly any cars, and the bike felt like it was flying. Honestly, it was one of those rides where everything aligns… except for my overthinking brain, which stubbornly insisted on revisiting work worries instead of just enjoying the moment."
            },
            {
              "id": 2,
              "type": "paragraph",
              "value": "Initially, I planned to stick to my “zone 2” training (for the non-cyclists: a chill pace). But, of course, that plan went out the window, as it usually does. Lesson learned: I should really stop obsessing over the numbers on my cycling computer."
            },
            {
              "id": 3,
              "type": "image",
              "value": "/cycling/centuries/2024-10-24/map.png"
            },
            {
              "id": 4,
              "type": "paragraph",
              "value": "When I arrived in Zhovkva, I rewarded myself with a coffee and a tiny piece of Napoleon cake at a cozy café on the main square. They served the cake with some kind of sauce that was absolutely divine. I sat outside, soaking up the sun, eavesdropping on the locals’ cheerful conversations, and enjoying the warmth. Even better, a friendly dog strolled over, and after a short “chat,” decided to sit and chill beside me. A true gentleman of the canine world."
            },

            {
              "id": 5,
              "type": "paragraph",
              "value": "On the way back, things got a bit tougher, but the magic never faded. One of the highlights was a quiet, enchanting forest near Ivano-Frankove. The rolling hills there were a dream to ride through. As for the workout itself, I noticed I’ve improved at keeping a steady power output on climbs. All those short ascents in the 300–400-watt range felt surprisingly smooth. Progress feels good, even if it’s a bit nerdy to measure rides in watts."
            },

            {
              "id": 6,
              "type": "paragraph",
              "value": "All in all, this was one of those rides that reminds you why cycling is so special. Just me, my bike, the open road… and the occasional existential crisis."
            },
            {
              "id": 7,
              "type": "images",
              "value": [
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7085.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7085.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7088.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7088.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7093.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7093.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7100.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7100.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7113.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7113.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7126.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7126.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7127.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7127.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7128.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7128.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7129.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/2024-10-24/IMG_7129.jpeg"
                }
              ]
            }
          ]
        },
        {
          "id": 1,
          "heading": "August 25, 2023 – Bukovel, My First Century Ride",
          "children": [
            {
              "id": 1,
              "type": "paragraph",
              "value": "Ah, my first 100 kilometers. I still remember the night before - staring at the ceiling, second-guessing my life choices, and plotting a route that felt ambitious, even for the freshly motivated version of me. I’d trained consistently for months, but there’s always that little voice that wonders, “Can I really do this?” Especially when the Carpathian Mountains are involved. The hills! And, well, gravity wasn’t exactly my best friend."
            },
            {
              "id": 2,
              "type": "image",
              "value": "/cycling/centuries/first-100-route.jpeg"
            },
            {
              "id": 3,
              "type": "paragraph",
              "value": "The ride began with a chill in the air - one of those mornings where you question why anyone would voluntarily leave a warm bed for a cold saddle. But as the sun kissed the mountains, the beauty of the Carpathians stole the show, and all my pre-ride worries melted away. Cold? What cold? I mean, except for the moments when I could only think about the cold. I stayed in <a href=\"https://www.booking.com/Share-eqDVX1\" target=\"_blank\">HVOYA apart-hotel<a/> in Bukovel, plan was to ride from <b>Bukovel</b> west exit -> <b>Bilyn</b> -> <b>Yablunytsia</b> -> <b>Tatariv</b> -> and back to <b>Bukovel</b> but entering from the east. It sounded simple enough. In reality? Well, let’s just say every hill had a sense of humor I wasn’t quite ready for."
            },
            {
              "id": 4,
              "type": "images",
              "value": [
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/yablunytsya.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/yablunytsya.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia-2.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia-2.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia-3.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia-3.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia-4.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia-4.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia-lunch.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia-lunch.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia-river.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/yasinia-river.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/polianytsya.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/polianytsya.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/polianytsya-2.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/polianytsya-2.jpeg"
                },
                {
                  "original": "https://petroborovets.github.io/rovets/cycling/centuries/yablunytsya-2.jpeg",
                  "thumbnail": "https://petroborovets.github.io/rovets/cycling/centuries/yablunytsya-2.jpeg"
                }
              ]
            },
            {
              "id": 5,
              "type": "paragraph",
              "value": "<b>Some stats from <a href=\"https://www.strava.com/activities/9716744953/overview\" target=\"_blank\">Strava<a/>:</b>"
            },
            {
              "id": 6,
              "type": "list",
              "value": [
                "Distance: 100.01 km (because 100 km exactly is too mainstream)",
                "Time moving: 3h 42m",
                "Time total: 4h 30m (because we all need breaks, right?)",
                "Avg speed: 27.0 km/h",
                "Avg HR: 153 bpm",
                "Power: 184 W",
                "Breaks: 1 - hot dog in Yasinia (55km), 2- coffe break in Tatariv (85k)"
              ]
            }
          ]
        }
      ]
    }
  ]
}
